In [42]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [3]:
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman_baseball")
df = pd.read_sql("SELECT * FROM batting;", con=engine)
df.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

### 1.
#### a. Find all players in the database who played at Vanderbilt University.

#### b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.

#### c. Sort this list in descending order by the total salary earned.

#### d. Which Vanderbilt player earned the most money in the majors?

In [13]:
#load school data
schools = pd.read_sql('SELECT * FROM schools', con=engine)
schools

,schoolid,schoolname,schoolcity,schoolstate,schoolnick
0,abilchrist,Abilene Christian University,Abilene,TX,USA
1,adelphi,Adelphi University,Garden City,NY,USA
2,adrianmi,Adrian College,Adrian,MI,USA
3,akron,University of Akron,Akron,OH,USA
4,alabama,University of Alabama,Tuscaloosa,AL,USA
...,...,...,...,...,...
1202,wwashngton,Western Washington University,Bellingham,WA,USA
1203,wyoming,University of Wyoming,Laramie,WY,USA
1204,xavier,Xavier University,Cincinnati,OH,USA
1205,yale,Yale University,New Haven,CT,USA
1206,youngst,Youngstown State University,Youngstown,OH,USA

In [14]:
#find vanderbilt info for schoolid
vanderbilt = schools[schools['schoolname'] == 'Vanderbilt University']
vanderbilt

     schoolid             schoolname schoolcity schoolstate schoolnick
1110    vandy  Vanderbilt University  Nashville          TN        USA

In [15]:
#load college players data
college_playing = pd.read_sql('SELECT * FROM collegeplaying', con=engine)
college_playing.head()

    playerid schoolid  yearid
0  aardsda01   pennst    2001
1  aardsda01     rice    2002
2  aardsda01     rice    2003
3   abadan01  gamiddl    1992
4   abadan01  gamiddl    1993

In [18]:
#create df of players from vandy by filtering on schoolid
vandy_players = college_playing[college_playing['schoolid'] == 'vandy']
vandy_players

        playerid schoolid  yearid
232    alvarpe01    vandy    2006
233    alvarpe01    vandy    2007
234    alvarpe01    vandy    2008
895    baxtemi01    vandy    2004
896    baxtemi01    vandy    2005
...          ...      ...     ...
16806  willimi01    vandy    1970
16807  willimi01    vandy    1971
16808  willimi01    vandy    1972
17280   zeidjo01    vandy    2006
17281   zeidjo01    vandy    2007

[65 rows x 3 columns]

In [22]:
#load salary data
salaries = pd.read_sql('SELECT * FROM salaries', con=engine)
salaries.head()

   yearid teamid lgid   playerid    salary
0    1985    ATL   NL  barkele01  870000.0
1    1985    ATL   NL  bedrost01  550000.0
2    1985    ATL   NL  benedbr01  545000.0
3    1985    ATL   NL   campri01  633333.0
4    1985    ATL   NL  ceronri01  625000.0

In [40]:
#create salary df of vandy players by grouping by playerid and summing all salary info
vandy_sals = salaries[salaries['playerid'].isin(vandy_players['playerid'])]
vandy_sals = vandy_sals.groupby('playerid')['salary'].sum().reset_index()
vandy_sals.head()

    playerid      salary
0  alvarpe01  20681704.0
1  baxtemi01   2094418.0
2  chrisni01    500000.0
3   corajo01   5622500.0
4  flahery01   4061000.0

In [30]:
#load player df
people = pd.read_sql('SELECT * FROM people', con=engine)
people.head()

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [36]:
#find players names from people df by filtering it with new vandy_players table created above
vandy_df = people[people['playerid'].isin(vandy_players['playerid'])]
vandy_df_names = vandy_df[['namegiven','namelast', 'playerid']]
#vandy_df_names
v_df_name_sal = vandy_df_names.merge(vandy_sals, on='playerid', how='left')
v_df_name_sal.head()

        namegiven    namelast   playerid      salary
0    Pedro Manuel     Alvarez  alvarpe01  20681704.0
1  Michael Joseph      Baxter  baxtemi01   2094418.0
2   Nicholas John  Christiani  chrisni01    500000.0
3    Cyril Wilson     Collins  colliwi01         NaN
4     Jose Manuel        Cora   corajo01   5622500.0

In [39]:
#sort the table on salary descending. print statement to show who was the highest paid
v_df_name_sal = v_df_name_sal.sort_values(by = 'salary', ascending=False)
v_df_name_sal.head()
print(v_df_name_sal[v_df_name_sal['salary']==v_df_name_sal['salary'].max()])

       namegiven namelast   playerid      salary
16  David Taylor    Price  priceda01  81851296.0

#### 2. Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.

In [46]:
fielding = pd.read_sql('SELECT * FROM fielding', con=engine)
fielding

,playerid,yearid,stint,teamid,lgid,pos,g,gs,innouts,po,a,e,dp,pb,wp,sb,cs,zr
0,abercda01,1871,1,TRO,NA,SS,1,NaN,NaN,1,3.0,2.0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,2B,22,NaN,NaN,67,72.0,42.0,5.0,NaN,NaN,NaN,NaN,NaN
2,addybo01,1871,1,RC1,NA,SS,3,NaN,NaN,8,14.0,7.0,0.0,NaN,NaN,NaN,NaN,NaN
3,allisar01,1871,1,CL1,NA,2B,2,NaN,NaN,1,4.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
4,allisar01,1871,1,CL1,NA,OF,29,NaN,NaN,51,3.0,7.0,1.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
136810,zobribe01,2016,1,CHN,NL,2B,119,113.0,2929.0,177,250.0,7.0,52.0,NaN,NaN,NaN,NaN,NaN
136811,zobribe01,2016,1,CHN,NL,OF,46,29.0,859.0,43,1.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
136812,zobribe01,2016,1,CHN,NL,SS,1,0.0,6.0,0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
136813,zuninmi01,2016,1,SEA,AL,C,52,48.0,1331.0,400,15.0,0.0,0.0,3.0,NaN,19.0,7.0,NaN
136814,zychto01,2016,1,SEA,AL,P,12,0.0,41.0,0,0.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN

In [45]:
#create a dictionary, use map method to use it as reference for new column 

# pos_dict = {'OF':'outfield', 'SS':'infield', '1B':'infield', '2B':'infield', '3B':'infield', 'P':'battery', 'C':'battery'}

# fielding['gen_pos'] = fielding['pos'].map(pos_dict)
# fielding

In [50]:
#with numpy

fielding['gen_pos'] = np.select([(fielding['pos'] == 'OS'), 
                                 (fielding['pos'] == 'SS') or (fielding['pos'] == '1B') or (fielding['pos'] == '2B') 
                                 or (fielding['pos'] == '3B'),
                                (fielding['pos'] == 'P') or (fielding['pos']) == 'C'], ['outfield','infield','battery'])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().